[
    {
        "id": 1,
        "name": "Wirreles Headpnones",
        "category": "Headphones",
        "price": "99.9$",
        "image": "images/headphone1.jpg",
        "description": "Wireless Headphones - Ultimate Sound Experience.",  
        "description1": "Immerse yourself in crystal-clear audio with our Wireless Headphones. Designed for both comfort and performance these headphones offer an unparalleled listening experience with advanced features and sleek modern design. Whether you’re working out commuting or relaxing at home these headphones provide an exceptional wire-free experience allowing you to enjoy music podcasts and calls without distractions.",
        "description2": "Key Features",
        "description3": "Superior Sound Quality Equipped with high-fidelity drivers the headphones deliver rich bass clear mids and sparkling treble for an immersive listening experience",
        "description4": "Bluetooth Connectivity Easily connect to your smartphone tablet laptop or other Bluetooth-enabled devices without the hassle of wires. Enjoy seamless pairing and a stable connection with a range of up to 30 feet",
        "description5": "Noise-Canceling Technology Block out external noise with the built-in active noise cancellation (ANC) feature so you can focus on your music or calls even in noisy environments",
        "description6": "Long Battery Life With up to 20 hours of playtime on a full charge these headphones are perfect for long commutes travel or a full day of work. Plus they offer a quick recharge feature so you can get back to listening faster",
        "description7": "Comfortable Fit The adjustable headband and memory foam ear cushions ensure a snug yet comfortable fit for long listening sessions. The lightweight design makes them ideal for all-day wear",
        "description8": "Built-in Microphone Take calls effortlessly with the integrated microphone offering clear voice transmission for hands-free communication. Ideal for conference calls chatting with friends or managing your day-to-day activities",
        "description9": "Touch Controls Adjust volume skip tracks answer calls and more with simple touch controls on the ear cup. No need to take out your device everything is at your fingertips",
        "description10": "Stylish and Portable The foldable design makes it easy to store and carry and the sleek modern look ensures you always stay in style",
        "description11": "Specifications",
        "description12": "Bluetooth version 5.0 Battery life Up to 20 hours Charging time 1.5 hours Noise-canceling Active Noise Cancellation (ANC) Weight 250g Frequency Response 20Hz – 20kHz Connectivity Wireless (Bluetooth) Compatible with iOS Android and other Bluetooth devices Microphone Yes (built-in)",
        "description13": "Why Choose Our Wireless Headphones",
        "description14": "Experience superior audio quality without the hassle of wires Ideal for daily use travel or as a companion for workouts Enjoy comfort style and convenience with every use",
        "description15": "Elevate your listening experience today with our Wireless Headphones designed for those who appreciate quality sound and freedom of movement"
    },
    {
        "id": 2,
        "name": "Gaming Headset",
        "category": "Headphones",
        "price": "79.9$",
        "image":"images/headphone2.jpg",
        "description": "The Gaming Headset is designed to provide an exceptional audio experience for gamers.",  
        "description1": "Its high-fidelity drivers deliver rich, detailed sound, making every explosion and footstep feel lifelike.",
        "description2": "The headset features virtual surround sound, creating a 3D soundscape to help you pinpoint enemy movements with precision.",
        "description3": "A noise-isolating microphone ensures clear communication by reducing background noise during team calls or gaming sessions.",
        "description4": "With an adjustable headband and plush ear cushions, it offers comfort for extended gaming marathons.",
        "description5": "The lightweight design minimizes fatigue, even during long hours of gameplay. Customizable RGB lighting on the ear cups lets you add style and match your gaming setup.",
        "description6": "The headset is compatible with multiple platforms, including PC, PlayStation, Xbox, Nintendo Switch, and mobile devices.",
        "description7": "It connects via a standard 3.5mm audio jack or USB, ensuring versatility for all gaming needs. Convenient in-line controls allow you to adjust volume, mute the microphone, or toggle sound modes with ease. Built with durable materials, the headset is designed to withstand intense use and last through countless gaming sessions.",
        "description8": "Its 50mm drivers provide a frequency response range of 20Hz to 20kHz for immersive audio.",
        "description9": "The detachable boom microphone adds flexibility, and the customizable lighting enhances your gaming ambiance.",
        "description10": "With a cable length of 2.2 meters, it provides freedom of movement while gaming.",
        "description11": "The Gaming Headset combines performance, comfort, and style, making it a perfect choice for gamers.",
        "description12": "Elevate your gaming experience with superior sound and unmatched features.",
        "description13": "The Gaming Headset offers high-fidelity audio and virtual surround sound for an immersive gaming experience.",
        "description14": "Designed with comfort in mind, it features plush ear cushions, an adjustable headband, and durable materials for extended use.",
        "description15": "Compatible with multiple platforms, it also includes a noise-isolating microphone, customizable RGB lighting, and intuitive in-line controls for seamless performance."
    },
    {
        "id": 3,
        "name": "Bluetooth Earbuds",
        "category": "Headphones",
        "price": "49.9$",
        "image":"images/headphone3.jpg",
        "description": "Bluetooth Earbuds deliver crystal-clear sound with powerful bass and balanced treble.",  
        "description1": "They are designed for both comfort and convenience, making them ideal for everyday use.",
        "description2": "The lightweight and ergonomic design ensures a snug fit for all-day wear.",
        "description3": "With advanced Bluetooth 5.0 technology, they provide a stable and seamless connection.",
        "description4": "The earbuds offer up to 8 hours of playtime on a single charge.",
        "description5": "The portable charging case extends the battery life to a total of 24 hours.",
        "description6": "Active noise cancellation minimizes background sounds for focused listening.",
        "description7": "Transparency mode allows you to stay aware of your surroundings when needed.",
        "description8": "Touch controls on the earbuds let you adjust volume, skip tracks, and answer calls.",
        "description9": "The built-in microphone ensures clear voice quality during phone calls or video chats.",
        "description10": "They are water-resistant, making them perfect for workouts and outdoor activities.",
        "description11": "Quick charging gives you 1 hour of playback with just a 10-minute charge.",
        "description12": "They are compatible with iOS, Android, and other Bluetooth-enabled devices.",
        "description13": "The earbuds automatically pair with your device when taken out of the case.",
        "description14": "Compact and stylish, they easily fit into your pocket or bag.",
        "description15": "Bluetooth Earbuds are the perfect combination of style, functionality, and performance."
    },    {
        "id": 4,
        "name": "Over-Ear Headphones",
        "category": "Headphones",
        "price": "89.9$",
        "image":"images/headphone4.jpg",
        "description": "Over-Ear Headphones deliver immersive, high-fidelity audio with rich bass and clear treble.",  
        "description1": "The over-ear design provides excellent noise isolation for an uninterrupted listening experience.",
        "description2": "They feature soft, memory foam ear cushions for maximum comfort during long use.",
        "description3": "An adjustable headband ensures a perfect fit for all head sizes.",
        "description4": "The headphones connect wirelessly via Bluetooth for tangle-free convenience.",
        "description5": "With a battery life of up to 30 hours, they are perfect for long commutes or travel.",
        "description6": "Quick charging provides up to 3 hours of playback with just 10 minutes of charge.",
        "description7": "Built-in controls on the ear cups allow you to adjust volume and skip tracks easily.",
        "description8": "A built-in microphone enables clear hands-free calls and voice assistant activation.",
        "description9": "Active noise-canceling technology blocks out ambient noise for focused listening.",
        "description10": "The headphones support wired connections with an included 3.5mm audio cable.",
        "description11": "They fold compactly for easy storage and portability.",
        "description12": "Compatible with smartphones, tablets, laptops, and other Bluetooth devices.",
        "description13": "High-quality materials ensure durability and a premium look and feel.",
        "description14": "They are ideal for music, gaming, or watching movies with exceptional sound quality.",
        "description15": "Over-Ear Headphones combine style, comfort, and performance to enhance your audio experience."
    },    {
        "id": 5,
        "name": "Portable Speaker",
        "category": "Speakers",
        "price": "59.9$",
        "image":"images/speaker1.jpg",
        "description": "The Portable Speaker delivers powerful, clear sound with deep bass and crisp highs.",  
        "description1": "It features a compact and lightweight design, making it easy to carry anywhere.",
        "description2": "With Bluetooth connectivity, it pairs seamlessly with your devices for wireless playback.",
        "description3": "The speaker offers up to 12 hours of battery life for all-day listening.",
        "description4": "A fast-charging feature allows you to quickly recharge for uninterrupted use.",
        "description5": "It is water-resistant, making it ideal for outdoor activities and poolside use.",
        "description6": "Built-in controls let you adjust volume, skip tracks, and play or pause music effortlessly.",
        "description7": "The speaker includes a built-in microphone for hands-free calls and voice assistant support.",
        "description8": "It supports multiple connectivity options, including Bluetooth, AUX, and USB.",
        "description9": "Pair two speakers together for stereo sound and a more immersive audio experience.",
        "description10": "The rugged design ensures durability for travel and adventures.",
        "description11": "LED lights add a stylish touch and enhance the ambiance during use.",
        "description12": "It is compatible with smartphones, tablets, laptops, and other audio devices.",
        "description13": "The speaker delivers a 360-degree sound experience, filling any room or outdoor space.",
        "description14": "Its advanced drivers ensure rich sound quality, even at higher volumes.",
        "description15": "The Portable Speaker is perfect for music, parties, and outdoor gatherings."
    },    {
        "id": 6,
        "name": "Waterproof Speaker",
        "category": "Speakers",
        "price": "69.9$",
        "image":"images/speaker2.jpg",
        "description": "The Waterproof Speaker delivers powerful and clear sound in any environment.",  
        "description1": "It is fully waterproof with an IPX7 rating, allowing it to be submerged in water without damage.",
        "description2": "The durable design makes it perfect for outdoor adventures and poolside use.",
        "description3": "With Bluetooth connectivity, it pairs effortlessly with your devices for wireless audio.",
        "description4": "The speaker provides up to 24 hours of battery life for uninterrupted listening.",
        "description5": "A fast-charging feature ensures minimal downtime between uses.",
        "description6": "Its compact and portable design allows you to take it anywhere with ease.",
        "description7": "The speaker includes built-in controls for volume adjustment, track skipping, and play/pause.",
        "description8": "A built-in microphone enables hands-free calling and voice assistant support.",
        "description9": "It features 360-degree sound to fill any room or outdoor space with immersive audio.",
        "description10": "You can pair two speakers for stereo sound and a richer listening experience.",
        "description11": "The rugged exterior protects it from drops, dust, and extreme weather conditions.",
        "description12": "It is compatible with smartphones, tablets, laptops, and other Bluetooth devices.",
        "description13": "LED lights enhance the visual appeal and can be customized for various moods.",
        "description14": "The speaker delivers deep bass and crisp highs for a balanced sound experience.",
        "description15": "The Waterproof Speaker is ideal for music lovers who enjoy adventures and outdoor fun."
    },    {
        "id": 7,
        "name": "Smart Speaker",
        "category": "Speakers",
        "price": "129.9$",
        "image":"images/speaker3.jpg",
        "description": "The Smart Speaker combines exceptional audio quality with intelligent voice control.",  
        "description1": "It delivers rich, immersive sound with deep bass and clear vocals.",
        "description2": "Built-in voice assistants like Alexa or Google Assistant make it easy to control your music hands-free.",
        "description3": "You can use voice commands to check the weather, set reminders, or control smart home devices.",
        "description4": "The speaker connects seamlessly to Wi-Fi and Bluetooth for flexible playback options.",
        "description5": "Multi-room functionality lets you sync multiple speakers for a whole-home audio experience.",
        "description6": "It features a sleek, modern design that blends well with any decor.",
        "description7": "Touch controls on the top allow for easy volume adjustment and playback management.",
        "description8": "Far-field microphones ensure accurate voice recognition, even in noisy environments.",
        "description9": "It supports a wide range of music streaming services like Spotify, Apple Music, and more.",
        "description10": "The compact size makes it perfect for use in the kitchen, bedroom, or office.",
        "description11": "Built-in privacy features, such as a microphone mute button, provide added security.",
        "description12": "Firmware updates keep the speaker up-to-date with the latest features.",
        "description13": "You can customize audio settings through a dedicated app for a personalized listening experience.",
        "description14": "The Smart Speaker is compatible with both iOS and Android devices.",
        "description15": "It is perfect for music, podcasts, and as a central hub for your smart home."
    },    {
        "id": 8,
        "name": "Bass Boost Speaker",
        "category": "Speakers",
        "price": "99.9$",
        "image":"images/speaker4.jpg",
        "description": "The Bass Boost Speaker delivers deep, powerful bass for an enhanced listening experience.",  
        "description1": "It features advanced bass-enhancing technology for rich and immersive sound.",
        "description2": "The speaker is designed to produce clear mids and crisp highs alongside its strong bass.",
        "description3": "It connects via Bluetooth, ensuring seamless wireless audio streaming from your devices.",
        "description4": "With a battery life of up to 20 hours, it provides uninterrupted music playback.",
        "description5": "A quick charge feature offers hours of playtime with just a short recharge.",
        "description6": "Its rugged design makes it durable and suitable for indoor and outdoor use.",
        "description7": "An IPX6 water resistance rating protects it from splashes and rain.",
        "description8": "Built-in controls let you adjust bass levels, change tracks, and manage volume effortlessly.",
        "description9": "LED lighting effects pulse in sync with the music, creating a dynamic visual experience.",
        "description10": "Pair two speakers together for an even more powerful stereo sound.",
        "description11": "The speaker is compact and portable, making it easy to carry wherever you go.",
        "description12": "A built-in microphone allows for hands-free calling and voice assistant commands.",
        "description13": "It is compatible with a wide range of devices, including smartphones, tablets, and laptops.",
        "description14": "The speaker also includes an AUX port for wired connectivity options.",
        "description15": "The Bass Boost Speaker is perfect for parties, outdoor gatherings, and bass lovers."
    },    {
        "id": 9,
        "name": "Silicone Case for iPhone",
        "category": "Case",
        "price": "19.9$",
        "image":"images/case1.jpg",
        "description": "The Silicone Case for iPhone offers premium protection with a sleek design.",  
        "description1": "Made from high-quality silicone, it provides a soft and smooth texture.",
        "description2": "The case is lightweight, adding minimal bulk to your device.",
        "description3": "Its snug fit ensures full coverage, protecting your phone from scratches and drops.",
        "description4": "The interior is lined with soft microfiber to prevent damage to the phone’s surface.",
        "description5": "It is designed with precise cutouts for easy access to all ports and buttons.",
        "description6": "The case supports wireless charging without the need to remove it.",
        "description7": "Its anti-slip finish ensures a secure grip, reducing the chances of accidental drops.",
        "description8": "The raised edges around the screen and camera provide additional protection.",
        "description9": "It is resistant to fingerprints, dust, and minor stains, keeping it clean and stylish.",
        "description10": "The case is available in a variety of colors to suit your personal style.",
        "description11": "Its durable material ensures long-lasting performance and protection.",
        "description12": "The slim design maintains the phone’s original look while enhancing usability.",
        "description13": "It is easy to install and remove without damaging the phone.",
        "description14": "The Silicone Case is compatible with all iPhone models, ensuring a perfect fit.",
        "description15": "This case combines functionality, style, and reliable protection for your iPhone."
    },    {
        "id": 10,
        "name": "Leather Case for Samsung",
        "category": "Case",
        "price": "29.9$",
        "image":"images/case2.jpg",
        "description": "The Leather Case for Samsung offers a premium and sophisticated look.",  
        "description1": "Made from genuine leather, it provides a smooth and luxurious texture.",
        "description2": "The case is designed to protect your phone from scratches, drops, and daily wear.",
        "description3": "Its slim profile ensures that your device remains lightweight and easy to carry.",
        "description4": "The interior is lined with soft microfiber to prevent damage to the phone’s surface.",
        "description5": "Precise cutouts allow easy access to all buttons, ports, and the camera.",
        "description6": "The case is compatible with wireless charging, so you don’t need to remove it.",
        "description7": "Raised edges around the screen and camera offer additional protection.",
        "description8": "Its non-slip design ensures a secure grip, minimizing the risk of accidental drops.",
        "description9": "The case is available in multiple colors to match your personal style.",
        "description10": "It develops a natural patina over time, adding character to the leather.",
        "description11": "The sturdy construction ensures durability for long-lasting use.",
        "description12": "It fits snugly, providing full coverage while maintaining a sleek appearance.",
        "description13": "The case is easy to install and remove without damaging your phone.",
        "description14": "It is specifically designed for Samsung models, ensuring a perfect fit.",
        "description15": "The Leather Case combines elegance, functionality, and reliable protection for your Samsung device."
    },    {
        "id": 11,
        "name": "Transparent Case for OnePlus",
        "category": "Case",
        "price": "19.9$",
        "image":"images/case3.jpg",
        "description": "The Transparent Case for OnePlus offers minimalistic and sleek protection.",  
        "description1": "Made from durable, clear TPU material, it showcases the phone’s design.",
        "description2": "The case provides reliable protection against scratches, bumps, and minor drops.",
        "description3": "Its lightweight and slim profile keep your device easy to handle.",
        "description4": "The flexible edges make it easy to install and remove without damaging the phone.",
        "description5": "It features precise cutouts for easy access to ports, buttons, and the camera.",
        "description6": "The case is designed to support wireless charging without interference.",
        "description7": "Raised edges around the screen and camera offer added protection.",
        "description8": "The smooth finish prevents fingerprints and smudges, keeping it looking clean.",
        "description9": "It is available in a crystal-clear version to highlight the phone’s natural beauty.",
        "description10": "The clear design allows your phone’s color and branding to shine through.",
        "description11": "Its anti-slip surface provides a secure grip for better handling.",
        "description12": "The case is compatible with OnePlus models, ensuring a perfect fit.",
        "description13": "It blends functionality with style, keeping your phone protected yet visible.",
        "description14": "The Transparent Case is ideal for those who want minimalist protection without covering up their device.",
        "description15": "It combines durability, clarity, and everyday usability."
    },    {
        "id": 12,
        "name": "Rugged Case for Google Pixel",
        "category": "Case",
        "price": "29.9$",
        "image":"images/case4.jpg",
        "description": "The Rugged Case for Google Pixel offers durable protection for your device.",  
        "description1": "Made from a combination of tough polycarbonate and flexible TPU, it withstands impacts and drops.",
        "description2": "The case features reinforced corners to absorb shocks and prevent damage.",
        "description3": "Its rugged design provides excellent grip, reducing the chances of slipping.",
        "description4": "It is built to protect against scratches, dust, and accidental falls.",
        "description5": "The case includes raised edges around the screen and camera for added safety.",
        "description6": "The textured surface enhances grip and prevents fingerprints.",
        "description7": "It supports wireless charging without the need to remove the case.",
        "description8": "Precise cutouts ensure easy access to ports, buttons, and the fingerprint sensor.",
        "description9": "The rugged design is perfect for outdoor activities and heavy use.",
        "description10": "It has a sleek yet rugged look, combining style with functionality.",
        "description11": "The case is lightweight while providing maximum protection.",
        "description12": "Its durable material ensures long-lasting performance.",
        "description13": "The case is compatible with Google Pixel models, offering a perfect fit.",
        "description14": "It is designed to keep your phone safe while maintaining easy usability.",
        "description15": "The Rugged Case is ideal for users looking for strong protection in tough conditions."
    },    {
        "id": 13,
        "name": "Compact Power Bank",
        "category": "PowerBank",
        "price": "19.9$",
        "image":"images/powerbank1.jpg",
        "description": "The Compact Power Bank provides portable and reliable charging on the go.",  
        "description1": "Its slim and lightweight design makes it easy to carry in your bag or pocket.",
        "description2": "With a 5000 mAh capacity, it can charge most smartphones up to one and a half times.",
        "description3": "The power bank features a high-quality lithium-polymer battery for fast and efficient charging.",
        "description4": "It comes with a built-in LED indicator that shows the remaining battery level.",
        "description5": "The dual USB output allows you to charge two devices simultaneously.",
        "description6": "It supports fast charging technology to quickly replenish your devices.",
        "description7": "The compact size makes it perfect for travel, commuting, or everyday use.",
        "description8": "Its durable casing protects the internal components from bumps and scratches.",
        "description9": "It is compatible with a wide range of devices, including smartphones, tablets, and cameras.",
        "description10": "The power bank includes a micro-USB input for convenient recharging.",
        "description11": "It has overcharge, short-circuit, and overheating protection for safe usage.",
        "description12": "The non-slip surface provides a secure grip during use.",
        "description13": "Its small form factor allows easy storage in bags, backpacks, or even pockets.",
        "description14": "The Compact Power Bank (5000 mAh) combines portability with reliable charging capacity.",
        "description15": "It ensures you stay powered up no matter where you are."
    },    {
        "id": 14,
        "name": "Fast Charging Power Bank",
        "category": "PowerBank",
        "price": "29.9$",
        "image":"images/powerbank2.jpg",
        "description": "The Fast Charging Power Bank delivers quick and efficient charging for your devices.",  
        "description1": "It features a high-capacity battery, usually around 10,000 mAh, to charge multiple devices.",
        "description2": "With fast charging technology, it can recharge smartphones and tablets in record time.",
        "description3": "It supports both USB-C and standard USB outputs for versatile compatibility.",
        "description4": "The power bank provides dual USB ports, allowing you to charge two devices simultaneously.",
        "description5": "It comes with a built-in LED indicator to display the battery level.",
        "description6": "The durable and lightweight design makes it easy to carry in your bag or pocket.",
        "description7": "It features advanced safety protections, including overcharge and overheating protection.",
        "description8": "The compact size makes it ideal for travel, outdoor adventures, and daily use.",
        "description9": "The fast-charging power bank is compatible with a wide range of devices, including smartphones, tablets, and more.",
        "description10": "It supports quick charging protocols like PD (Power Delivery) and QC (Quick Charge).",
        "description11": "The non-slip surface provides a secure grip during use.",
        "description12": "It can recharge itself quickly via a USB-C cable, saving you time.",
        "description13": "The power bank ensures your devices stay powered up wherever you go.",
        "description14": "Its durable casing protects against bumps, drops, and minor impacts.",
        "description15": "The Fast Charging Power Bank combines power, speed, and reliability for efficient on-the-go charging."
    },    {
        "id": 15,
        "name": "Solar Power Bank",
        "category": "PowerBank",
        "price": "39.9$",
        "image":"images/powerbank3.jpg",
        "description": "The Solar Power Bank combines eco-friendly solar charging with reliable battery storage.",  
        "description1": "It features a high-capacity battery, typically ranging from 10,000 to 20,000 mAh.",
        "description2": "The solar panels on the surface allow for charging in outdoor environments using sunlight.",
        "description3": "It provides multiple charging options, including solar, USB, and micro-USB inputs.",
        "description4": "The power bank supports fast charging technology to quickly recharge your devices.",
        "description5": "It features dual USB outputs, allowing you to charge two devices simultaneously.",
        "description6": "The rugged and water-resistant design makes it perfect for outdoor adventures.",
        "description7": "Built-in LED lights can serve as a flashlight for added convenience in low-light situations.",
        "description8": "The durable casing protects the internal components from dust, drops, and minor impacts.",
        "description9": "It includes an LED indicator to show the remaining battery level.",
        "description10": "The solar power bank is compatible with a wide range of devices, such as smartphones, tablets, and cameras.",
        "description11": "It features overcharge, overcurrent, and short-circuit protection for safe charging.",
        "description12": "The compact and portable design makes it easy to carry on hikes, camping trips, or outdoor excursions.",
        "description13": "It can also be charged through traditional USB, reducing reliance on solar energy alone.",
        "description14": "The solar panels can provide partial charge support during long outdoor stays.",
        "description15": "The Solar Power Bank combines solar energy with long-lasting battery capacity for sustainable power on the go."
    },    {
        "id": 16,
        "name": "High-Capacity Power Bank",
        "category": "PowerBank",
        "price": "49.9$",
        "image":"images/powerbank4.jpg",
        "description": "The High-Capacity Power Bank (20,000 mAh) offers extended charging for multiple devices.",  
        "description1": "Its large 20,000 mAh battery can charge smartphones, tablets, and other devices multiple times.",
        "description2": "It features dual USB ports, allowing you to charge two devices simultaneously.",
        "description3": "The power bank supports fast charging technology to quickly replenish your devices.",
        "description4": "It comes with a built-in LED indicator to show the remaining battery level.",
        "description5": "The durable and lightweight design makes it easy to carry in your bag or backpack.",
        "description6": "It includes a high-quality lithium-polymer battery for efficient and safe charging.",
        "description7": "The power bank is equipped with advanced safety features, including overcharge protection.",
        "description8": "It supports both USB-C and standard USB outputs for versatile compatibility.",
        "description9": "The compact size ensures convenient storage while offering a high charging capacity.",
        "description10": "The high-capacity power bank is ideal for long trips, outdoor adventures, or heavy daily use.",
        "description11": "It features a non-slip surface for a secure grip during use.",
        "description12": "The power bank can charge tablets, laptops, and other power-hungry devices efficiently.",
        "description13": "It includes a micro-USB input for convenient recharging.",
        "description14": "The high-capacity battery ensures reliable power when you need it most.",
        "description15": "It’s compatible with a wide range of devices, including smartphones, cameras, and Bluetooth accessories."
    },    {
        "id": 17,
        "name": "Wacom Intuos Pro",
        "category": "Stylus",
        "price": "379.9$",
        "image":"images/stylus1.jpg",
        "description": "The Wacom Intuos Pro is a professional-grade graphics tablet designed for creative professionals.",  
        "description1": "It features a large, high-resolution, customizable working area for precision and accuracy.",
        "description2": "The tablet comes with a pressure-sensitive pen that provides natural pen-on-paper feel.",
        "description3": "It offers 8192 levels of pressure sensitivity for detailed and nuanced drawing.",
        "description4": "The pen includes customizable buttons and an eraser, enhancing workflow efficiency.",
        "description5": "It connects seamlessly to both Windows and macOS devices via USB or Bluetooth.",
        "description6": "The tablet supports multi-touch gestures for intuitive control and navigation.",
        "description7": "It features eight customizable ExpressKeys™ for quick access to shortcuts and commands.",
        "description8": "The included Pro Pen 2 provides precise control with tilt recognition and virtually no lag.",
        "description9": "The tablet's surface is designed to reduce glare and provide a smooth drawing experience.",
        "description10": "It is ideal for digital artists, illustrators, designers, and photographers.",
        "description11": "The Wacom Intuos Pro works with popular creative software such as Adobe Photoshop, Illustrator, and CorelDRAW.",
        "description12": "It includes a wireless charging dock for the pen, eliminating the need for batteries.",
        "description13": "The tablet is built with durable materials for long-lasting performance.",
        "description14": "It supports customizable touch rings for zooming, scrolling, and rotating.",
        "description15": "The Wacom Intuos Pro offers precision, versatility, and professional-grade performance for creative work."
    },    {
        "id": 18,
        "name": "Apple Pencil (2nd Generation)",
        "category": "Stylus",
        "price": "129.9$",
        "image":"images/stylus2.jpg",
        "description": "The Apple Pencil (2nd Generation) is designed for precise and natural drawing on iPads.",  
        "description1": "It features a magnetic attachment that securely pairs and charges wirelessly.",
        "description2": "The pencil supports tilt and pressure sensitivity for a more realistic drawing experience.",
        "description3": "It allows for up to 12 hours of active use on a single charge.",
        "description4": "The flat side of the pencil attaches magnetically to the side of iPads for easy storage.",
        "description5": "It includes touch controls for quick access to functions like switching tools or erasing.",
        "description6": "The Pencil 2 supports double-tapping for customizable shortcuts.",
        "description7": "It features low latency, making it feel like you’re drawing directly on the screen.",
        "description8": "The Apple Pencil is compatible with iPad Pro, iPad Air, and iPad (6th generation and later).",
        "description9": "It offers pixel-perfect precision for detailed artwork and note-taking.",
        "description10": "The battery indicator appears directly on the iPad screen for easy monitoring.",
        "description11": "It allows precise control for tasks like sketching, drawing, annotating, and editing.",
        "description12": "The pencil supports fine detail with its responsive tip.",
        "description13": "It’s lightweight and easy to hold, making it comfortable for extended use.",
        "description14": "The Apple Pencil (2nd Generation) is perfect for creatives, artists, and professionals.",
        "description15": "It combines advanced technology with seamless integration for an enhanced iPad experience."
    },    {
        "id": 19,
        "name": "Microsoft Surface Pen",
        "category": "Stylus",
        "price": "99.9$",
        "image":"images/stylus3.jpg",
        "description": "The Microsoft Surface Pen is a versatile tool designed for precision input on Surface devices.",  
        "description1": "It features 4,096 levels of pressure sensitivity, allowing for detailed and natural writing and drawing.",
        "description2": "The pen connects instantly to Surface devices via Bluetooth for seamless use.",
        "description3": "It includes a precision tip that feels natural for both sketching and note-taking.",
        "description4": "The pen supports tilt functionality, making shading and angle adjustments more intuitive.",
        "description5": "It has an integrated eraser for easy and convenient corrections.",
        "description6": "The pen allows you to quickly launch apps and access shortcuts with customizable buttons.",
        "description7": "It offers up to 15 hours of battery life on a full charge.",
        "description8": "The Surface Pen can be recharged via USB-C, ensuring long-lasting use.",
        "description9": "It features an optimized rubber grip for comfort during extended use.",
        "description10": "The pen works with popular Microsoft apps like OneNote, Microsoft Whiteboard, and Adobe Illustrator.",
        "description11": "It supports accurate input for writing, drawing, annotating, and editing.",
        "description12": "The pen has a lightweight design that makes it easy to carry and hold.",
        "description13": "It seamlessly integrates with Surface devices for a more productive workflow.",
        "description14": "The Microsoft Surface Pen is perfect for creatives, students, and professionals.",
        "description15": "It provides precision and versatility for all your digital creative needs."
    },    {
        "id": 20,
        "name": "XP-Pen Deco Mini 7",
        "category": "Stylus",
        "price": "49.9$",
        "image":"images/stylus4.jpg",
        "description": "The XP-Pen Deco Mini 7 is a compact and affordable graphics tablet for digital artists and beginners.",  
        "description1": "It features a responsive 7 x 4-inch working area that provides ample space for creative tasks.",
        "description2": "The tablet comes with a battery-free stylus that offers 8,192 levels of pressure sensitivity.",
        "description3": "It supports tilt functionality, allowing for natural shading and brush effects.",
        "description4": "The stylus includes customizable buttons that can be programmed for shortcuts.",
        "description5": "The tablet connects easily to both Windows and macOS devices via USB.",
        "description6": "It has a lightweight and portable design, making it ideal for travel and on-the-go use.",
        "description7": "The Deco Mini 7 includes a smooth and responsive drawing surface for precise control.",
        "description8": "It supports a wide range of drawing and design software like Photoshop, Illustrator, and CorelDRAW.",
        "description9": "The tablet features customizable ExpressKeys for quick access to frequently used commands.",
        "description10": "It provides stable and accurate pen input, making it great for detailed artwork.",
        "description11": "The XP-Pen Deco Mini 7 is perfect for artists, designers, and content creators.",
        "description12": "It delivers reliable performance at an affordable price point.",
        "description13": "The tablet is built with durable materials for long-lasting use.",
        "description14": "It supports multi-touch gestures for intuitive navigation and zooming.",
        "description15": "The XP-Pen Deco Mini 7 combines precision, functionality, and portability for digital creativity."
    },    {
        "id": 21,
        "name": "Fast Charging Wall Charger",
        "category": "Charger",
        "price": "19.9$",
        "image":"images/charger1.jpg",
        "description": "The Fast Charging Wall Charger delivers rapid and efficient power to your devices.",  
        "description1": "It features multiple USB ports, allowing you to charge multiple devices simultaneously.",
        "description2": "With fast-charging technology, it can replenish your devices in record time.",
        "description3": "The charger supports both USB-C and standard USB outputs for versatile compatibility.",
        "description4": "It provides up to 18W of power output for quick and efficient charging.",
        "description5": "The compact and lightweight design makes it easy to carry and store.",
        "description6": "It is compatible with a wide range of devices, including smartphones, tablets, and laptops.",
        "description7": "The wall charger includes built-in overcharge and overheating protection for safe use.",
        "description8": "It charges devices quickly while keeping them safe from excessive power draw.",
        "description9": "The charger has a foldable plug for easy portability and travel.",
        "description10": "It supports fast-charging protocols like PD (Power Delivery) and QC (Quick Charge).",
        "description11": "The durable construction ensures long-lasting performance.",
        "description12": "The charger is ideal for use at home, in the office, or on the go.",
        "description13": "Its sleek design blends well with modern power adapters.",
        "description14": "The Fast Charging Wall Charger combines speed, efficiency, and convenience for daily use.",
        "description15": ""
    },    {
        "id": 22,
        "name": "Wireless Charging Pad",
        "category": "Charger",
        "price": "29.9$",
        "image":"images/charger2.jpg",
        "description": "The Wireless Charging Pad provides convenient and hassle-free charging for your devices.",  
        "description1": "It features a sleek and slim design that blends well with any workspace or nightstand.",
        "description2": "The pad supports fast wireless charging, allowing you to charge your phone quickly.",
        "description3": "It is compatible with a wide range of Qi-enabled devices, including smartphones and earbuds.",
        "description4": "The non-slip surface ensures your device stays securely in place during charging.",
        "description5": "It includes built-in cooling technology to prevent overheating while charging.",
        "description6": "The charging pad has an LED indicator that shows the charging status.",
        "description7": "It supports both vertical and horizontal charging orientations.",
        "description8": "The pad offers up to 10W of power output for efficient wireless charging.",
        "description9": "Its compact and lightweight design makes it easy to carry and travel with.",
        "description10": "It works with devices that support Qi wireless charging, eliminating the need for cables.",
        "description11": "The pad features a stylish and minimalist appearance that complements modern interiors.",
        "description12": "It includes built-in protection against overcurrent, overvoltage, and overheating.",
        "description13": "The wireless charging pad provides convenient and clutter-free power for your everyday use.",
        "description14": "It’s ideal for use at home, in the office, or on the go.",
        "description15": "The Wireless Charging Pad combines simplicity, efficiency, and convenience for wireless charging needs."
    },    {
        "id": 23,
        "name": "Car Charger with USB Ports",
        "category": "Charger",
        "price": "19.9$",
        "image":"images/charger3.jpg",
        "description": "The Car Charger with USB Ports provides convenient and fast charging while on the go.",  
        "description1": "It features multiple USB ports, allowing you to charge multiple devices simultaneously.",
        "description2": "The charger is compatible with smartphones, tablets, GPS devices, and more.",
        "description3": "It supports rapid charging technology to quickly replenish your devices.",
        "description4": "The compact design makes it easy to store in your car’s center console or glove box.",
        "description5": "It includes smart IC technology to detect and provide optimal charging for your devices.",
        "description6": "The charger supports both USB-A and USB-C outputs for versatile connectivity.",
        "description7": "It features a high power output of up to 24W, ensuring fast and efficient charging.",
        "description8": "The charger is made from durable materials, designed to withstand daily use in your car.",
        "description9": "It includes built-in safety features like overcharge protection and short-circuit prevention.",
        "description10": "The LED indicator shows the charging status, so you know when your devices are fully charged.",
        "description11": "It fits snugly into your car’s cigarette lighter or power outlet.",
        "description12": "The charger is small enough to be unobtrusive while offering powerful charging capabilities.",
        "description13": "It’s ideal for long road trips, daily commutes, or quick errands.",
        "description14": "The Car Charger with USB Ports ensures your devices stay powered while on the move.",
        "description15": "It combines convenience, speed, and reliable charging in a compact form factor."
    },    {
        "id": 24,
        "name": "Solar Charger",
        "category": "Charger",
        "price": "39.9$",
        "image":"images/charger4.jpg",
        "description": "The Solar Charger harnesses sunlight to provide eco-friendly power on the go.",  
        "description1": "It features built-in solar panels that allow you to recharge the battery using sunlight.",
        "description2": "The charger has a high-capacity battery, typically ranging from 10,000 to 20,000 mAh.",
        "description3": "It can charge smartphones, tablets, cameras, and other USB-powered devices.",
        "description4": "The rugged design makes it ideal for outdoor adventures, camping, and hiking.",
        "description5": "It includes multiple USB ports for charging two devices simultaneously.",
        "description6": "The solar charger supports fast charging technology for quick device replenishment.",
        "description7": "It comes with a flashlight function, useful for night-time use or emergencies.",
        "description8": "The device is lightweight and portable, making it easy to carry in bags or backpacks.",
        "description9": "The built-in battery can be recharged via solar energy or traditional USB input.",
        "description10": "It features durable materials that resist water, dust, and impacts.",
        "description11": "The solar charger has a built-in LED indicator to show battery status.",
        "description12": "It supports a variety of devices, including smartphones, tablets, and cameras.",
        "description13": "It includes protection features like overcharge, overcurrent, and short-circuit prevention.",
        "description14": "The solar charger provides sustainable and reliable power during long outdoor trips.",
        "description15": "It’s perfect for camping, hiking, road trips, and any outdoor activity."
    },    {
        "id": 25,
        "name": "USB-C to Lightning Cable",
        "category": "Cable",
        "price": "19.9$",
        "image":"images/cable1.jpg",
        "description": "The USB-C to Lightning Cable allows you to charge and sync your Apple devices.",  
        "description1": "It is designed to connect USB-C devices, such as laptops or chargers, to Lightning-enabled iPhones or iPads.",
        "description2": "The cable supports fast charging, enabling quicker battery replenishment for your Apple devices.",
        "description3": "It is made from durable materials, ensuring long-lasting performance and flexibility.",
        "description4": "The compact and lightweight design makes it easy to carry and store.",
        "description5": "It delivers high-speed data transfer, making it ideal for transferring large files quickly.",
        "description6": "The cable is compatible with a wide range of Apple devices, including iPhones, iPads, and AirPods.",
        "description7": "It features reversible connectors, so you can plug it in either way.",
        "description8": "The USB-C to Lightning Cable supports power delivery (PD), providing optimal charging efficiency.",
        "description9": "It has built-in safety features to protect your devices from overcurrent and overheating.",
        "description10": "The cable is designed to withstand everyday wear and tear, ensuring reliable performance.",
        "description11": "It allows you to sync your data at high speeds between your Apple devices and your computer.",
        "description12": "The cable supports up to 20W fast charging, perfect for quickly topping up your device’s battery.",
        "description13": "It provides a secure and stable connection for charging and syncing without interruption.",
        "description14": "The USB-C to Lightning Cable is perfect for use with new-generation Apple devices.",
        "description15": "It combines fast charging, durability, and efficient data transfer for everyday use."
    },    {
        "id": 26,
        "name": "Micro-USB to USB Cable",
        "category": "Charger",
        "price": "9.9$",
        "image":"images/cable2.jpg",
        "description": "The Micro-USB to USB Cable allows you to connect and charge Micro-USB devices.",  
        "description1": "It is compatible with a wide range of smartphones, tablets, cameras, and other USB-powered devices.",
        "description2": "The cable supports fast charging, ensuring quick battery replenishment for your devices.",
        "description3": "It features a high-speed data transfer, making it ideal for transferring files quickly.",
        "description4": "The cable is made from durable materials, ensuring long-lasting performance.",
        "description5": "Its compact design makes it easy to carry and store in bags or pockets.",
        "description6": "It includes a standard USB connector on one end and a Micro-USB connector on the other.",
        "description7": "The cable provides stable and reliable connectivity for charging and syncing.",
        "description8": "It supports up to 2.4A charging, making it efficient for powering devices.",
        "description9": "The Micro-USB to USB Cable is compatible with older devices and chargers.",
        "description10": "It includes built-in protection features to prevent overcharging and short-circuiting.",
        "description11": "The cable is designed to resist bending and fraying during daily use.",
        "description12": "It supports syncing data between Micro-USB devices and computers at high speeds.",
        "description13": "The cable is ideal for use with older smartphones, tablets, cameras, and other electronics.",
        "description14": "It allows you to connect to USB wall chargers, power banks, and laptops for charging.",
        "description15": "The Micro-USB to USB Cable combines versatility, durability, and reliable performance."
    },    {
        "id": 27,
        "name": "USB-C to USB-C Cable",
        "category": "Cable",
        "price": "9.9$",
        "image":"images/cable3.jpg",
        "description": "The USB-C to USB-C Cable allows you to connect and charge USB-C devices.",  
        "description1": "It is designed for use with smartphones, tablets, laptops, and other USB-C powered gadgets.",
        "description2": "The cable supports fast charging, delivering up to 100W power output for efficient device replenishment.",
        "description3": "It features high-speed data transfer, making it ideal for transferring large files quickly.",
        "description4": "The cable is made from durable materials, ensuring long-lasting performance and flexibility.",
        "description5": "Its reversible design allows you to easily connect devices in either orientation.",
        "description6": "It is compatible with a wide range of USB-C devices, including smartphones, tablets, and laptops.",
        "description7": "The cable supports Power Delivery (PD) technology, enabling faster and more efficient charging.",
        "description8": "It includes built-in safety features to protect devices from overcurrent and overheating.",
        "description9": "The USB-C to USB-C Cable is ideal for use with newer generation devices that feature USB-C ports.",
        "description10": "It has a compact and lightweight design, making it easy to carry and store.",
        "description11": "It provides stable and reliable connectivity for charging and data transfer.",
        "description12": "The cable supports high-speed syncing, perfect for transferring large amounts of data.",
        "description13": "It is ideal for use with USB-C laptops, power banks, monitors, and more.",
        "description14": "The cable combines fast charging, high-speed data transfer, and durability for everyday use.",
        "description15": "It’s perfect for users who need reliable connectivity for their USB-C devices."
    },    {
        "id": 28,
        "name": "3.5mm Audio Cable",
        "category": "Cable",
        "price": "9.9$",
        "image":"images/cable4.jpg",
        "description": "The 3.5mm Audio Cable allows you to connect audio devices for clear sound transmission.",  
        "description1": "It features a standard 3.5mm jack on both ends, making it compatible with most headphones and speakers.",
        "description2": "The cable supports high-fidelity audio, ensuring rich and clear sound quality.",
        "description3": "It is made from durable materials, designed to withstand everyday wear and tear.",
        "description4": "The cable is ideal for connecting smartphones, tablets, MP3 players, and other audio devices.",
        "description5": "It provides stable and reliable sound output, making it perfect for listening to music or podcasts.",
        "description6": "The flexible design allows for easy storage and tangle-free use.",
        "description7": "It supports both in-ear headphones and over-ear headphones with a 3.5mm input.",
        "description8": "The cable has a length of 3 to 6 feet, making it versatile for various setups.",
        "description9": "It allows you to share audio with others by connecting to external speakers or headphones.",
        "description10": "The 3.5mm Audio Cable features gold-plated connectors for optimal sound quality and corrosion resistance.",
        "description11": "It is compatible with a wide range of devices, including smartphones, tablets, laptops, and audio receivers.",
        "description12": "The cable provides clear and consistent sound without interruptions.",
        "description13": "It includes a strain-relief design that helps prevent fraying and breaking at the ends.",
        "description14": "The 3.5mm Audio Cable combines durability, flexibility, and excellent sound performance.",
        "description15": "It’s perfect for users looking to connect audio devices for a high-quality listening experience."
    }
]